* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Subprogram CA3900-N.
/**
/** :author github
/* 
DEFINE DATA  
LOCAL  USING NCDATA-L
LOCAL  USING NCCOMM-P
LOCAL
1 V-WORKREC (A80)
1 V-WORKFIELD (A16) 
1 V-SERVICENAME (A20) CONST<'CA3900'>
END-DEFINE
ON ERROR
  INCLUDE ERRLOG-I 'V-SERVICENAME' 
  ESCAPE ROUTINE
END-ERROR
READ (1) NCCUSTOMER
END-READ
END
